Revit 2027 API
View.AreAnnotationCategoriesHidden Property
 Indicates if annotation categories are currently hidden in the view.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool AreAnnotationCategoriesHidden { get; set; }
Public Property AreAnnotationCategoriesHidden As Boolean
	Get
	Set
public:
property bool AreAnnotationCategoriesHidden {
	bool get ();
	void set (bool value);
}
member AreAnnotationCategoriesHidden : bool with get, set
Property Value
Boolean
 True if annotation categories are currently hidden in the view, false otherwise.
See Also
Reference
View Class
Autodesk.Revit.DB Namespace